Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.ToolOptionNames.GridLine Field
 The grid line.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string GridLine = "sel_grid_line"
Public Const GridLine As String = "sel_grid_line"
Field Value
Type: String
See Also
Reference
TeklaStructuresSettings.ToolOptionNames Class
Tekla.Structures Namespace